<!DOCTYPE html>
<html>

<head>
  <meta http-equiv="Content-Type" content="text/html" charset="UTF-8" >
  <meta name="viewport" content="width=932" >
  <meta name="MobileOptimized" content="932" >
  <meta name="generator" content="We read the world wrong.">
  <title>自制RPM安装包-1</title>

  <link rel="stylesheet" type="text/css" href="/css/normalize.css">
  <link rel="stylesheet" type="text/css" href="/css/awe.css">
  <link rel="stylesheet" type="text/css" href="/css/social-likes.css">
  <link rel="alternate" type="application/rss+xml" title="RSS" href="">

  <script src="//cdn.staticfile.org/jquery/1.10.2/jquery.min.js"></script>
  <script src="/js/imgLiquid-min.js"></script>
  <script src="/js/social-likes.min.js"></script>
  <script src="/js/post.js"></script>
</head>

<body>
  <div class="main-container">
    

<div class="box profile">
  <div class="heading" style="background: #3e5354 url(/images/bg-heading.jpg) no-repeat;">
    <div class="profile-img">
      <a href="//readme.org.cn/"><img src="//channer.qiniudn.com/5e9aa7884d67a089a8580433136c4321%20(1).jpg" width="154" height="150" alt="image description"></a>
    </div>
    <strong class="user"><a href="/">We read the world wrong.</a></strong>
    <span class="locate">Shanghai</span>
  </div>
  <div class="setting">
    <a href="//readme.org.cn/" class="btn-profile">Profile</a>
    <!-- <a href="/" class="btn-photos">Photos</a> -->
    <a href="/" class="btn-follow">Follow me</a>
  </div>
</div>

    
<div class="two-columns post-page">
  <div class="content">

    <div class="post box nocover">
      <em class="date"><span>05</span>6月</em>
      <h1 class="post-title"><a href="/2014/06/05/How-to-distribute-your-software-more-easily-with-RPM-1/">自制RPM安装包-1</a></h1>
      <div class="post-content"><blockquote>
<p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x4E3B;&#x8981;&#x662F;&#x4ECB;&#x7ECD;RPM(Red Hat Package Mananer)&#x4E00;&#x4E9B;&#x6838;&#x5FC3;&#x7406;&#x8BBA;&#x77E5;&#x8BC6;&#xFF0C;&#x4EE5;&#x53CA;&#x5236;&#x4F5C;&#x5DE5;&#x4F5C;&#x524D;&#x7684;&#x51C6;&#x5907;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x4E0D;&#x6D89;&#x53CA;&#x5B9E;&#x9645;&#x7684;&#x64CD;&#x4F5C;&#x6F14;&#x793A;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x53EA;&#x60F3;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x505A;&#x7684;&#x4EBA;&#xFF0C;&#x5EFA;&#x8BAE;&#x76F4;&#x63A5;&#x770B;&#x4E0B;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x3002;</p>
<p>&#x672C;&#x6587;&#x662F;&#x5B98;&#x65B9;Max-RPM&#x8282;&#x9009;&#x7FFB;&#x8BD1;&#x7248;&#xFF0C;<a href="http://www.rpm.org/max-rpm" title="Max-RPM" target="_blank" rel="external">&#x60F3;&#x770B;&#x539F;&#x6587;&#x70B9;&#x51FB;&#x8FD9;&#x91CC;</a>&#x3002;</p>
</blockquote>
<p>&#x548C;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x7C7B;&#x4F3C;&#xFF0C;&#x5236;&#x4F5C;&#x4E00;&#x4E2A;RPM&#x5305;&#x4E5F;&#x9700;&#x8981;&#x4E09;&#x4E2A;&#x8FC7;&#x7A0B;&#x8F93;&#x5165;&#x3001;&#x5904;&#x7406;&#x548C;&#x8F93;&#x51FA;&#x3002;</p>
<h2 id="&#x8F93;&#x5165;">&#x8F93;&#x5165;</h2>
<p>&#x6574;&#x4E2A;RPM&#x7684;&#x5236;&#x4F5C;&#x8FC7;&#x7A0B;&#x88AB;&#x4E09;&#x4E2A;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x9A71;&#x4F7F;&#x7740;&#x3002;&#x4ECE;&#x4E25;&#x683C;&#x610F;&#x4E49;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x5176;&#x4E2D;&#x4E24;&#x4E2A;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x662F;&#x5236;&#x4F5C;&#x8FC7;&#x7A0B;&#x6240;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x800C;&#x7B2C;&#x4E09;&#x4E2A;&#x5219;&#x662F;&#x53EF;&#x9009;&#x7684;&#x3002;&#x9664;&#x975E;&#x4F60;&#x6253;&#x7B97;&#x628A;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x914D;&#x7F6E;&#x6216;&#x4EE3;&#x7801;&#x6253;&#x5305;&#x8FDB;&#x53BB;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x57FA;&#x672C;&#x4E0A;&#x6CA1;&#x673A;&#x4F1A;&#x7528;&#x5230;&#x5B83;&#x3002;</p>
<h3 id="1-_&#x6E90;&#x7801;&#x5305;">1. &#x6E90;&#x7801;&#x5305;</h3>
<p>&#x5728;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#xFF0C;&#x9996;&#x5148;&#x4E5F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x70B9;&#x5C31;&#x662F;&#x4F60;&#x8981;&#x5148;&#x6709;&#x4E00;&#x4E2A;&#x6E90;&#x7801;&#x5305;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x6E90;&#x7801;&#x5305;&#xFF0C;&#x4F60;&#x6253;&#x7B97;&#x62FF;&#x4EC0;&#x4E48;&#x6765;&#x5236;&#x4F5C;RPM&#x5305;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x60F3;&#x6253;&#x5305;&#x67D0;&#x4EBA;&#x7684;&#x5F00;&#x6E90;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x6240;&#x8C13;&#x7684;&#x6E90;&#x7801;&#x5305;&#x901A;&#x5E38;&#x5C31;&#x662F;&#x6307;&#x8F6F;&#x4EF6;&#x4F5C;&#x8005;&#x53D1;&#x5E03;&#x7684;&#x88AB;&#x538B;&#x7F29;&#x7684;tar&#x5305;&#x3002;&#x5F53;&#x7136;&#xFF0C;RPM&#x4E5F;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5176;&#x4ED6;&#x683C;&#x5F0F;&#x7684;&#x6E90;&#x7801;&#x5305;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x6B65;&#x9AA4;&#x3002;</p>
<p>&#x603B;&#x4E4B;&#x4E0D;&#x7BA1;&#x5728;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F60;&#x90FD;&#x4E0D;&#x5E94;&#x8BE5;&#x53BB;&#x4FEE;&#x6539;&#x5236;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E2D;&#x7528;&#x5230;&#x7684;&#x6E90;&#x7801;&#x5305;&#x3002;&#x5982;&#x679C;&#x4F60;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7B2C;&#x4E09;&#x65B9;&#x7684;RPM&#x5305;&#x5236;&#x4F5C;&#x8005;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x7684;&#x6E90;&#x7801;&#x5305;&#x5E94;&#x8BE5;&#x6765;&#x81EA;&#x8F6F;&#x4EF6;&#x4F5C;&#x8005;&#x7684;&#x6587;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#x3002;&#x800C;&#x5982;&#x679C;&#x4F60;&#x5C31;&#x662F;&#x8F6F;&#x4EF6;&#x7684;&#x4F5C;&#x8005;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x9009;&#x62E9;&#x6743;&#x5C31;&#x5728;&#x4F60;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD8;&#x662F;&#x5EFA;&#x8BAE;&#x4F60;&#x9009;&#x62E9;&#x4E3B;&#x5206;&#x652F;&#x4E0A;&#x7684;&#x6E90;&#x7801;&#x3002;</p>
<h3 id="2-_&#x8865;&#x4E01;&#x6587;&#x4EF6;">2. &#x8865;&#x4E01;&#x6587;&#x4EF6;</h3>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x5728;&#x5F3A;&#x8C03;&#x672A;&#x88AB;&#x4FEE;&#x6539;&#x7684;&#x6E90;&#x7801;&#x5305;&#xFF1F;&#x539F;&#x56E0;&#x5C31;&#x662F;&#xFF0C;RPM&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x81EA;&#x52A8;&#x4E3A;&#x8F6F;&#x4EF6;&#x6253;&#x8865;&#x4E01;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6839;&#x636E;&#x8865;&#x4E01;&#x7684;&#x7279;&#x6027;&#x53EF;&#x5C06;&#x8865;&#x4E01;&#x6587;&#x4EF6;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x4E24;&#x7C7B;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8865;&#x4E01;&#x90FD;&#x5C5E;&#x4E8E;&#x5176;&#x4E2D;&#x4E00;&#x7C7B;&#xFF1A;</p>
<ul>
<li>&#x89E3;&#x51B3;&#x4E86;&#x76EE;&#x6807;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x95EE;&#x9898;&#x3002;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x5305;&#x62EC;&#x6539;&#x53D8;makefiles&#x6765;&#x628A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B89;&#x88C5;&#x5230;&#x66F4;&#x5408;&#x9002;&#x4F4D;&#x7F6E;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x89E3;&#x51B3;&#x8DE8;&#x5E73;&#x53F0;&#x51B2;&#x7A81;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x7528;sysV&#x526F;&#x672C;&#x6765;&#x66FF;&#x6362;BSB&#x7CFB;&#x7EDF;&#x8C03;&#x7528;&#x3002;</li>
<li>&#x521B;&#x5EFA;&#x90A3;&#x4E9B;&#x901A;&#x5E38;&#x5E94;&#x8BE5;&#x5728;&#x5B89;&#x88C5;&#x8FC7;&#x7A0B;&#x7684;&#x914D;&#x7F6E;&#x9636;&#x6BB5;&#x4E2D;&#x88AB;&#x521B;&#x5EFA;&#x7684;&#x6587;&#x4EF6;</li>
</ul>
<h4 id="&#x521B;&#x5EFA;&#x8865;&#x4E01;">&#x521B;&#x5EFA;&#x8865;&#x4E01;</h4>
<p>&#x8003;&#x8651;&#x8865;&#x4E01;&#x662F;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x542C;&#x8D77;&#x6765;&#x4F3C;&#x4E4E;&#x5F88;&#x8BA9;&#x4EBA;&#x6C14;&#x9981;&#xFF0C;&#x4F46;&#x8FD9;&#x5176;&#x5B9E;&#x662F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x3002;&#x4E0B;&#x9762;&#x5C31;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x505A;&#x5230;&#xFF1A;</p>
<ol>
<li>&#x89E3;&#x538B;&#x6E90;&#x7801;&#x5305;</li>
<li>&#x91CD;&#x547D;&#x540D;&#x9876;&#x7EA7;&#x76EE;&#x5F55;&#xFF0C;&#x6BD4;&#x5982;&#x4F7F;&#x5B83;&#x4EE5;&#x201D;.orig&#x201D;&#x7ED3;&#x5C3E;</li>
<li>&#x518D;&#x6B21;&#x89E3;&#x538B;&#x6E90;&#x7801;&#x5305;&#xFF0C;&#x8FD9;&#x6B21;&#x4E0D;&#x8FDB;&#x884C;&#x91CD;&#x547D;&#x540D;</li>
</ol>
<p>&#x4F60;&#x7B2C;&#x4E8C;&#x6B21;&#x89E3;&#x538B;&#x5F97;&#x5230;&#x7684;&#x6E90;&#x7801;&#x6811;&#x5C06;&#x4F1A;&#x6210;&#x4E3A;&#x4F60;&#x6253;&#x5305;&#x5236;&#x4F5C;RPM&#x5305;&#x8FC7;&#x7A0B;&#x4E2D;&#x552F;&#x4E00;&#x88AB;&#x7528;&#x5230;&#x7684;&#x6E90;&#x7801;&#x6811;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8F6F;&#x4EF6;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x8BA2;&#x5236;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x975E;&#x5E38;&#x597D;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x7ED9;&#x6E90;&#x7801;&#x6253;&#x8865;&#x4E01;&#x4E86;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x5F97;&#x4E0D;&#x505A;&#x4E00;&#x4E9B;&#x4FEE;&#x6539;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5C31;&#x5FC5;&#x987B;&#x521B;&#x5EFA;&#x4E00;&#x7CFB;&#x5217;&#x76F8;&#x5173;&#x7684;&#x8865;&#x4E01;&#x6587;&#x4EF6;&#x3002;&#x4E3A;&#x4E86;&#x521B;&#x5EFA;&#x8865;&#x4E01;&#x6587;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x6253;&#x7B97;&#x7B80;&#x5355;&#x7684;&#x6E05;&#x7406;&#x4E0B;&#x6E90;&#x7801;&#x76EE;&#x5F55;&#x4E0B;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x9012;&#x5F52;&#x7684;diff&#x547D;&#x4EE4;&#x6765;&#x6BD4;&#x8F83;&#x6784;&#x5EFA;RPM&#x5305;&#x65F6;&#x6240;&#x7528;&#x7684;&#x6E90;&#x7801;&#x6811;&#x548C;&#x6700;&#x521D;&#x7684;&#x672A;&#x88AB;&#x4FEE;&#x6539;&#x7684;&#x6E90;&#x7801;&#x6811;&#x662F;&#x5426;&#x4E00;&#x81F4;&#x3002;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#xFF01;</p>
<h3 id="3-_Spec&#x6587;&#x4EF6;">3. Spec&#x6587;&#x4EF6;</h3>
<p>Spec&#x6587;&#x4EF6;&#x662F;&#x6784;&#x5EFA;RPM&#x5B89;&#x88C5;&#x5305;&#x7684;&#x6838;&#x5FC3;&#x6587;&#x4EF6;&#x3002;Spec&#x6587;&#x4EF6;&#x5305;&#x542B;&#x4E86;RPM&#x6784;&#x5EFA;&#x8F6F;&#x4EF6;&#x5305;&#x6240;&#x5FC5;&#x987B;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4E5F;&#x5305;&#x542B;&#x4E86;&#x6307;&#x5BFC;RPM&#x6784;&#x5EFA;&#x6240;&#x9700;&#x7684;&#x6307;&#x4EE4;&#xFF0C;&#x5B83;&#x5728;&#x6982;&#x5FF5;&#x4E0A;&#x548C;Makefile&#x7C7B;&#x4F3C;&#x3002;Spec&#x6587;&#x4EF6;&#x4E5F;&#x660E;&#x786E;&#x89C4;&#x5B9A;&#x4E86;&#x54EA;&#x4E9B;&#x6587;&#x4EF6;&#x662F;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x53C8;&#x8BE5;&#x88AB;&#x5B89;&#x88C5;&#x5230;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x3002;</p>
<p>&#x4F60;&#x4E5F;&#x8BB8;&#x5DF2;&#x7ECF;&#x731C;&#x5230;&#x4E86;&#xFF0C;&#x65E2;&#x7136;Spec&#x6709;&#x90A3;&#x4E48;&#x591A;&#x804C;&#x8D23;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x683C;&#x5F0F;&#x60F3;&#x5FC5;&#x4E5F;&#x662F;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x7684;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x597D;&#x5728;&#x5B83;&#x5DF2;&#x7ECF;&#x6309;&#x7167;&#x76F8;&#x5E94;&#x7684;&#x804C;&#x8D23;&#x5212;&#x5206;&#x51FA;&#x4E86;&#x5F88;&#x591A;&#x7AE0;&#x8282;&#xFF0C;&#x4F7F;&#x6211;&#x4EEC;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#x5904;&#x7406;&#x548C;&#x638C;&#x63E1;&#x3002;Spec&#x6587;&#x4EF6;&#x603B;&#x5171;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x516B;&#x4E2A;&#x7AE0;&#x8282;&#xFF1A;</p>
<h4 id="&#x5E8F;&#x8A00;&#x7AE0;&#x8282;">&#x5E8F;&#x8A00;&#x7AE0;&#x8282;</h4>
<p>&#x5E8F;&#x8A00;&#x7AE0;&#x8282;&#x5305;&#x542B;&#x7684;&#x4FE1;&#x606F;&#x5C06;&#x5728;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x67E5;&#x770B;&#x8F6F;&#x4EF6;&#x5305;&#x4FE1;&#x606F;&#x7684;&#x65F6;&#x5019;&#x663E;&#x793A;&#x3002;&#x8FD9;&#x90E8;&#x5206;&#x5E94;&#x8BE5;&#x5305;&#x542B;&#x8F6F;&#x4EF6;&#x5305;&#x7684;&#x63CF;&#x8FF0;&#x4FE1;&#x606F;&#x548C;&#x7248;&#x672C;&#x53F7;&#x7B49;&#x4FE1;&#x606F;&#x3002;&#x4E0D;&#x4EC5;&#x5982;&#x6B64;&#xFF0C;&#x5E8F;&#x8A00;&#x7AE0;&#x8282;&#x8FD8;&#x5E94;&#x8BE5;&#x5305;&#x542B;&#x7684;&#x4FE1;&#x606F;&#x6709;&#xFF1A;&#x8BC6;&#x522B;&#x6E90;&#x7801;&#x5305;&#x548C;&#x8865;&#x4E01;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x751A;&#x81F3;&#xFF0C;&#x5982;&#x679C;&#x8F6F;&#x4EF6;&#x5305;&#x662F;&#x901A;&#x8FC7;&#x56FE;&#x5F62;&#x63A5;&#x53E3;&#x64CD;&#x4F5C;&#x7684;&#xFF0C;&#x8FD8;&#x5E94;&#x8BE5;&#x5305;&#x62EC;&#x8BC6;&#x522B;icon&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<h4 id="Prep&#x7AE0;&#x8282;">Prep&#x7AE0;&#x8282;</h4>
<h4 id="Build&#x7AE0;&#x8282;">Build&#x7AE0;&#x8282;</h4>
<h4 id="Install&#x7AE0;&#x8282;">Install&#x7AE0;&#x8282;</h4>
<h4 id="&#x5B89;&#x88C5;&#x548C;&#x5378;&#x8F7D;&#x7684;&#x811A;&#x672C;&#x6587;&#x4EF6;">&#x5B89;&#x88C5;&#x548C;&#x5378;&#x8F7D;&#x7684;&#x811A;&#x672C;&#x6587;&#x4EF6;</h4>
<p>&#x867D;&#x7136;&#x524D;&#x9762;&#x7AE0;&#x8282;&#x65E2;&#x5305;&#x62EC;&#x4E86;&#x6784;&#x5EFA;RPM&#x5305;&#x5FC5;&#x987B;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x4E5F;&#x5305;&#x62EC;&#x4E86;&#x5B9E;&#x9645;&#x9700;&#x8981;&#x6267;&#x884C;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x4F46;&#x4E0D;&#x540C;&#x4E8E;&#x524D;&#x9762;&#x51E0;&#x4E2A;&#x7AE0;&#x8282;&#xFF0C;&#x8FD9;&#x4E2A;&#x7AE0;&#x8282;&#x5305;&#x542B;&#x7684;&#x662F;&#x5728;&#x5B89;&#x88C5;&#x548C;&#x5378;&#x8F7D;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7528;&#x6237;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x5C06;&#x88AB;&#x6267;&#x884C;&#x7684;&#x811A;&#x672C;&#x6587;&#x4EF6;&#x3002;RPM&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x811A;&#x672C;&#x7684;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x5B89;&#x88C5;&#x524D;&#x6267;&#x884C;&#x7684;&#x811A;&#x672C;</li>
<li>&#x5B89;&#x88C5;&#x540E;&#x6267;&#x884C;&#x7684;&#x811A;&#x672C;</li>
<li>&#x5378;&#x8F7D;&#x524D;&#x6267;&#x884C;&#x7684;&#x811A;&#x672C;</li>
<li>&#x5378;&#x8F7D;&#x540E;&#x6267;&#x884C;&#x7684;&#x811A;&#x672C;</li>
</ul>
<p>&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x5E94;&#x7528;&#x573A;&#x666F;&#x5C31;&#x662F;&#x5F53;&#x4E00;&#x4E2A;&#x5B89;&#x88C5;&#x5305;&#x5305;&#x542B;&#x5171;&#x4EAB;&#x5E93;&#x6587;&#x4EF6;&#x65F6;&#x3002;&#x8FD9;&#x65F6;&#xFF0C;ldconfig&#x547D;&#x4EE4;&#x8981;&#x6C42;&#x5FC5;&#x987B;&#x5728;&#x5B89;&#x88C5;&#x6216;&#x8005;&#x5378;&#x8F7D;&#x8F6F;&#x4EF6;&#x5305;&#x4E4B;&#x540E;&#x88AB;&#x6267;&#x884C;&#x3002;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#x5C31;&#x662F;&#xFF0C;&#x5F53;&#x8F6F;&#x4EF6;&#x5305;&#x542B;&#x4E00;&#x4E2A;shell&#x65F6;&#xFF0C;/etc/shells&#x6587;&#x4EF6;&#x5FC5;&#x987B;&#x5728;&#x5B89;&#x88C5;&#x6216;&#x8005;&#x5378;&#x8F7D;&#x8F6F;&#x4EF6;&#x5305;&#x4E4B;&#x540E;&#x88AB;&#x6B63;&#x786E;&#x7684;&#x66F4;&#x65B0;&#x3002;</p>
<h4 id="&#x9A8C;&#x8BC1;&#x811A;&#x672C;">&#x9A8C;&#x8BC1;&#x811A;&#x672C;</h4>
<h4 id="Clean&#x7AE0;&#x8282;">Clean&#x7AE0;&#x8282;</h4>
<h4 id="&#x6587;&#x4EF6;&#x5217;&#x8868;">&#x6587;&#x4EF6;&#x5217;&#x8868;</h4>
<h2 id="RPM&#x5F15;&#x64CE;">RPM&#x5F15;&#x64CE;</h2>
<h2 id="&#x8F93;&#x51FA;">&#x8F93;&#x51FA;</h2>
<h3 id="1-_&#x6E90;&#x7801;&#x5305;&#x6587;&#x4EF6;">1. &#x6E90;&#x7801;&#x5305;&#x6587;&#x4EF6;</h3>
<h3 id="2-_RPM&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;">2. RPM&#x4E8C;&#x8FDB;&#x5236;&#x6587;&#x4EF6;</h3>
</div>

      <div class="bottom-panel">
        <ul class="social-likes" data-url="/2014/06/05/How-to-distribute-your-software-more-easily-with-RPM-1/">
          <li class="facebook" title="like"></li>
          <li class="plusone" title="google"></li>
        </ul>
      </div>
    </div>
    
    <div class="widget post-comment">
      <h2 class="title">Comments</h2>
      <section id="comments">
        <div id="disqus_thread">
          <noscript>Please enable JavaScript to view the <a href="//disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
        </div>
      </session>
    </div>
    
  </div>

  <div class="widgetarea">

    
    
<div class="tags widget">
  <h3 class="title">Tags</h3>
  <div style="text-align:center">
    
    <a class="button" href="/tags/Linux/">Linux</a>
    
  </div>
  
</div>


<div class="tagcloud" id="fbox-tagcloud" style="margin:10px; display:none; overflow: hidden"><a href="/tags/Linux/" style="font-size: NaNpx;">Linux</a><a href="/tags/MariaDB/" style="font-size: NaNpx;">MariaDB</a><a href="/tags/数据库/" style="font-size: NaNpx;">数据库</a></div>

    

    
      

<ul class="widget blogroll">
  <h3 class="title">Recent Post</h3>
  
    <li>
      <div class="text-holder">
        <span class="link-title"><a href="/2014/06/05/How-to-distribute-your-software-more-easily-with-RPM-1/">自制RPM安装包-1</a></span>
      </div>
    </li>
  
    <li>
      <div class="text-holder">
        <span class="link-title"><a href="/2014/06/05/Compiling-MariaDB-10-on-Centos64/">CentOS 6.4下编译安装MariaDB10</a></span>
      </div>
    </li>
  
</ul>


    

  </div>
</div>


  </div>
  
<div class="footer">
  <div class="container">
    <a href="//github.com/kywk/hexo-theme-awe">AWE for hexo</a> inspired by <a href="http://goo.gl/H8OMRE">Awesome UI Kit</a>,
    ported by <a href="//kywk.github.io/">MooCow (Aka. kywk)</a>.
    
    &copy; 2014 Channer All Rights Reserved
    
  </div>
</div>

  <!-- disqus -->

<script>
  var disqus_shortname = 'channerk';
  
  var disqus_url = 'http://readme.org.cn/2014/06/05/How-to-distribute-your-software-more-easily-with-RPM-1/';
  
  (function(){
    var dsq = document.createElement('script');
    dsq.type = 'text/javascript';
    dsq.async = true;
    dsq.src = '//go.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>



<script>
$(document).ready(function() {
  $('.imgLiquid').imgLiquid({fill:true, fadeInTime:500});
});
</script>


<!-- fancybox -->
<link rel="stylesheet" href="/package/fancybox/jquery.fancybox.css?v=2.1.5" type="text/css" media="screen" />
<script type="text/javascript" src="/package/fancybox/jquery.fancybox.pack.js?v=2.1.5"></script>
<script type="text/javascript">
(function($){
  $(".fancybox").fancybox();
  $(".various").fancybox({
    maxWidth  : 800,
    maxHeight : 600,
    fitToView : false,
    width   : '70%',
    height    : '70%',
    autoSize  : true,
    closeClick  : false,
    openEffect  : 'none',
    closeEffect : 'none'
  });
})(jQuery);
</script>
<script src="/js/post.js"></script>

</body>
</html>
